# Написать функцию, которая печататет строку <Name> на собеседовании в <company>,
# по-умолчанию считаем, что компания
# это Ozon, но можно и свою компанию создать.

def func(name, company='Ozon'):
    print(f'{name} на собеседовании в {company}')
